dmsComponentsTest/src/main/resources/requests/calculateDuties.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://tariff.core.ecf/TariffManagementServiceSOAP/v2/" xmlns:ns="http://cmm.core.ecf/BaseTypes/cmmServiceTypes/tariff/2017/01/26/" xmlns:ns1="http://tariff.core.ecf/messages/2017/01/30/" xmlns:ns2="http://cmm.core.ecf/BaseTypes/cmmEnhancementTypes/tariff/2017/01/26/" xmlns:ns3="http://cmm.core.ecf/BaseTypes/cmmDeclarationTypes/tariff/2017/01/26/" xmlns:ns4="http://cmm.core.ecf/BaseTypes/cmmPartyTypes/tariff/2017/01/26/">
   <soapenv:Header/>
   <soapenv:Body>
      <v2:calculateDuties xmlns:_26="http://cmm.core.ecf/BaseTypes/cmmServiceTypes/tariff/2017/01/26/" xmlns:_26_1="http://cmm.core.ecf/BaseTypes/cmmEnhancementTypes/tariff/2017/01/26/" xmlns:_26_2="http://cmm.core.ecf/BaseTypes/cmmDeclarationTypes/tariff/2017/01/26/" xmlns:_26_3="http://cmm.core.ecf/BaseTypes/cmmPartyTypes/tariff/2017/01/26/" xmlns:_30="http://tariff.core.ecf/messages/2017/01/30/">
         <tariffRequest>
            <_26:status>24</_26:status>
            <_26:id>a1821ad780d845fdb668abece974f255</_26:id>
            <_26:sequenceNumber>1</_26:sequenceNumber>
            <_26:timeStamp>2018-08-29T11:02:16.568Z</_26:timeStamp>
            <_30:referenceDate>2018-08-29T11:02:14.000Z</_30:referenceDate>
            <_30:defaultCurrencyType>GBP</_30:defaultCurrencyType>
            <_30:declaration>
               <_26_1:versionNumber>1</_26_1:versionNumber>
               <_26_1:creationDate>2018-08-29T11:02:14.538Z</_26_1:creationDate>
               <_26_2:modeOfEntry>2</_26_2:modeOfEntry>
               <_26_2:goodsItemCount>2</_26_2:goodsItemCount>
               <_26_2:communicationAddress>hmrcgwid:a102d4db-eed6-49b7-9cb0-8763a1f67010:b102d4db-eed6-49b7-9cb0-8763a1f67089</_26_2:communicationAddress>
               <_26_2:receiveDate>2018-08-29T12:02:14.000Z</_26_2:receiveDate>
               <_26_2:reference>18GB9JLC3CU1LFGVR2</_26_2:reference>
               <_26_2:submitterReference>TM_20180829120214</_26_2:submitterReference>
               <_26_2:tradeMovementType>IM</_26_2:tradeMovementType>
               <_26_2:type>Z</_26_2:type>
               <_26_2:packageCount>1.0</_26_2:packageCount>
               <_26_2:acceptanceDate>2018-08-29T11:02:14.000Z</_26_2:acceptanceDate>
               <_26_2:invoiceAmount unitType="GBP">113528.0</_26_2:invoiceAmount>
               <_26_2:procedureCategory>H1</_26_2:procedureCategory>
               <_30:consignmentShipment>
                  <_26_2:transactionNature>1</_26_2:transactionNature>
                  <_26_2:goodsShippedByContainer>true</_26_2:goodsShippedByContainer>
                  <_30:parties>
                     <_26_2:type>IM</_26_2:type>
                     <_30:partyIdentification>
                        <_26_3:type>1</_26_3:type>
                        <_26_3:number>GB614888019001</_26_3:number>
                     </_30:partyIdentification>
                  </_30:parties>
                  <_30:goodsItems>
                     <_26_2:hasDV1>true</_26_2:hasDV1>
                     <_26_2:isExported>false</_26_2:isExported>
                     <_26_2:methodOfPayment>E</_26_2:methodOfPayment>
                     <_26_2:preference>100</_26_2:preference>
                     <_26_2:statisticalAmount unitType="GBP">43100.98</_26_2:statisticalAmount>
                     <_26_2:invoiceAmount unitType="GBP">56764.0</_26_2:invoiceAmount>
                     <_26_2:specialProcedures>000</_26_2:specialProcedures>
                     <_26_2:previousProcedure>00</_26_2:previousProcedure>
                     <_26_2:requestedProcedure>40</_26_2:requestedProcedure>
                     <_26_2:sequenceNumber>1</_26_2:sequenceNumber>
                     <_26_2:transactionNature>1</_26_2:transactionNature>
                     <_26_2:valuationIndicator>0000</_26_2:valuationIndicator>
                     <_26_2:acceptanceDate>2017-09-30T23:00:00.000Z</_26_2:acceptanceDate>
                     <_30:additionalDocuments>
                        <_26_2:sequenceNumber>2</_26_2:sequenceNumber>
                        <_26_2:identifier>GBAEOCINSERTEORI</_26_2:identifier>
                        <_26_2:type>C514</_26_2:type>
                     </_30:additionalDocuments>
                     <_30:additionalDocuments>
                        <_26_2:sequenceNumber>4</_26_2:sequenceNumber>
                        <_26_2:identifier>GBCWPU1234567GB</_26_2:identifier>
                        <_26_2:type>C517</_26_2:type>
                     </_30:additionalDocuments>
                     <_30:additionalDocuments>
                        <_26_2:sequenceNumber>3</_26_2:sequenceNumber>
                        <_26_2:identifier>GBDPO7777777</_26_2:identifier>
                        <_26_2:type>C506</_26_2:type>
                     </_30:additionalDocuments>
                     <_30:additionalDocuments>
                        <_26_2:sequenceNumber>1</_26_2:sequenceNumber>
                        <_26_2:identifier>GBEIRINSERTEORI</_26_2:identifier>
                        <_26_2:type>C676</_26_2:type>
                     </_30:additionalDocuments>
                     <_30:countryRegions>
                        <_26_2:type>3</_26_2:type>
                        <_26_2:country>US</_26_2:country>
                     </_30:countryRegions>
                     <_30:countryRegions>
                        <_26_2:type>5</_26_2:type>
                        <_26_2:country>GB</_26_2:country>
                     </_30:countryRegions>
                     <_30:commodity>
                        <_26_2:sequenceNumber>1</_26_2:sequenceNumber>
                        <_26_2:description>Alloy Wheels</_26_2:description>
                        <_26_2:classifications>
                           <_26_2:identifier>87087050</_26_2:identifier>
                           <_26_2:sequenceNumber>1</_26_2:sequenceNumber>
                           <_26_2:type>TSP</_26_2:type>
                        </_26_2:classifications>
                        <_26_2:classifications>
                           <_26_2:identifier>10</_26_2:identifier>
                           <_26_2:sequenceNumber>2</_26_2:sequenceNumber>
                           <_26_2:type>TRC</_26_2:type>
                        </_26_2:classifications>
                        <_26_2:grossMass unitType="KGM">11473.0</_26_2:grossMass>
                        <_26_2:netMass unitType="KGM">11317.0</_26_2:netMass>
                        <_26_2:supplementaryUnits>20.0</_26_2:supplementaryUnits>
                     </_30:commodity>
                     <_30:customsValue>
                        <_26_2:amount unitType="GBP">56766.11</_26_2:amount>
                        <_26_2:source>Item price/amount</_26_2:source>
                        <_26_2:amountForVat unitType="GBP">56766.55</_26_2:amountForVat>
                     </_30:customsValue>
                  </_30:goodsItems>
                  <_30:goodsItems>
                     <_26_2:hasDV1>true</_26_2:hasDV1>
                     <_26_2:isExported>false</_26_2:isExported>
                     <_26_2:methodOfPayment>E</_26_2:methodOfPayment>
                     <_26_2:preference>100</_26_2:preference>
                     <_26_2:statisticalAmount unitType="GBP">43100.98</_26_2:statisticalAmount>
                     <_26_2:invoiceAmount unitType="GBP">56764.0</_26_2:invoiceAmount>
                     <_26_2:specialProcedures>000</_26_2:specialProcedures>
                     <_26_2:previousProcedure>00</_26_2:previousProcedure>
                     <_26_2:requestedProcedure>40</_26_2:requestedProcedure>
                     <_26_2:sequenceNumber>2</_26_2:sequenceNumber>
                     <_26_2:transactionNature>1</_26_2:transactionNature>
                     <_26_2:valuationIndicator>0000</_26_2:valuationIndicator>
                     <_26_2:acceptanceDate>2017-09-30T23:00:00.000Z</_26_2:acceptanceDate>
                     <_30:additionalDocuments>
                        <_26_2:sequenceNumber>4</_26_2:sequenceNumber>
                        <_26_2:identifier>GBCWPU1234567GB</_26_2:identifier>
                        <_26_2:type>C517</_26_2:type>
                     </_30:additionalDocuments>
                     <_30:additionalDocuments>
                        <_26_2:sequenceNumber>1</_26_2:sequenceNumber>
                        <_26_2:identifier>GBEIRINSERTEORI</_26_2:identifier>
                        <_26_2:type>C676</_26_2:type>
                     </_30:additionalDocuments>
                     <_30:additionalDocuments>
                        <_26_2:sequenceNumber>2</_26_2:sequenceNumber>
                        <_26_2:identifier>GBAEOCINSERTEORI</_26_2:identifier>
                        <_26_2:type>C514</_26_2:type>
                     </_30:additionalDocuments>
                     <_30:additionalDocuments>
                        <_26_2:sequenceNumber>3</_26_2:sequenceNumber>
                        <_26_2:identifier>GBDPO7777777</_26_2:identifier>
                        <_26_2:type>C506</_26_2:type>
                     </_30:additionalDocuments>
                     <_30:countryRegions>
                        <_26_2:type>3</_26_2:type>
                        <_26_2:country>US</_26_2:country>
                     </_30:countryRegions>
                     <_30:countryRegions>
                        <_26_2:type>5</_26_2:type>
                        <_26_2:country>GB</_26_2:country>
                     </_30:countryRegions>
                     <_30:commodity>
                        <_26_2:sequenceNumber>1</_26_2:sequenceNumber>
                        <_26_2:description>Alloy Wheels</_26_2:description>
                        <_26_2:classifications>
                           <_26_2:identifier>10</_26_2:identifier>
                           <_26_2:sequenceNumber>2</_26_2:sequenceNumber>
                           <_26_2:type>TRC</_26_2:type>
                        </_26_2:classifications>
                        <_26_2:classifications>
                           <_26_2:identifier>87087050</_26_2:identifier>
                           <_26_2:sequenceNumber>1</_26_2:sequenceNumber>
                           <_26_2:type>TSP</_26_2:type>
                        </_26_2:classifications>
                        <_26_2:grossMass unitType="KGM">11473.0</_26_2:grossMass>
                        <_26_2:netMass unitType="KGM">11317.0</_26_2:netMass>
                        <_26_2:supplementaryUnits>20.0</_26_2:supplementaryUnits>
                     </_30:commodity>
                     <_30:customsValue>
                        <_26_2:amount unitType="GBP">56766.11</_26_2:amount>
                        <_26_2:source>Item price/amount</_26_2:source>
                        <_26_2:amountForVat unitType="GBP">56766.55</_26_2:amountForVat>
                     </_30:customsValue>
                  </_30:goodsItems>
                  <_30:countryRegions>
                     <_26_2:type>2</_26_2:type>
                     <_26_2:country>US</_26_2:country>
                  </_30:countryRegions>
               </_30:consignmentShipment>
               <_30:parties>
                  <_26_2:type>DT</_26_2:type>
                  <_30:partyIdentification>
                     <_26_3:type>1</_26_3:type>
                     <_26_3:number>GB614888019001</_26_3:number>
                  </_30:partyIdentification>
               </_30:parties>
               <_30:parties>
                  <_26_2:type>TB</_26_2:type>
                  <_30:partyIdentification>
                     <_26_3:type>1</_26_3:type>
                     <_26_3:number>GB614888019001</_26_3:number>
                  </_30:partyIdentification>
               </_30:parties>
               <_30:parties>
                  <_26_2:type>VF</_26_2:type>
                  <_26_2:authorizationType>CWP</_26_2:authorizationType>
                  <_30:partyIdentification>
                     <_26_3:type>1</_26_3:type>
                     <_26_3:number>GB614888019001</_26_3:number>
                  </_30:partyIdentification>
               </_30:parties>
               <_30:parties>
                  <_26_2:type>VF</_26_2:type>
                  <_26_2:authorizationType>EIR</_26_2:authorizationType>
                  <_30:partyIdentification>
                     <_26_3:type>1</_26_3:type>
                     <_26_3:number>GB614888019001</_26_3:number>
                  </_30:partyIdentification>
               </_30:parties>
               <_30:parties>
                  <_26_2:type>VF</_26_2:type>
                  <_26_2:authorizationType>EXW</_26_2:authorizationType>
                  <_30:partyIdentification>
                     <_26_3:type>1</_26_3:type>
                     <_26_3:number>GB614888019001</_26_3:number>
                  </_30:partyIdentification>
               </_30:parties>
               <_30:parties>
                  <_26_2:type>VF</_26_2:type>
                  <_26_2:authorizationType>DPO</_26_2:authorizationType>
                  <_30:partyIdentification>
                     <_26_3:type>1</_26_3:type>
                     <_26_3:number>GB614888019001</_26_3:number>
                  </_30:partyIdentification>
               </_30:parties>
               <_30:parties>
                  <_26_2:type>EX</_26_2:type>
                  <_26_2:partyName>Vesteon Automotive Parts</_26_2:partyName>
               </_30:parties>
               <_30:customsOffices>
                  <_26_2:type>9</_26_2:type>
                  <_30:customsOfficeID>
                     <_26_3:type>96</_26_3:type>
                     <_26_3:number>GBLBA001</_26_3:number>
                  </_30:customsOfficeID>
               </_30:customsOffices>
            </_30:declaration>
         </tariffRequest>
      </v2:calculateDuties>
   </soapenv:Body>
</soapenv:Envelope>